In [132]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [111]:
df1=pd.read_csv("hiring.csv")

In [112]:
print(df1)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [113]:
df1['experience'].fillna("zero", inplace=True)

In [114]:
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [115]:
from word2number import w2n
df1['experience']=df1['experience'].apply(w2n.word_to_num)

In [116]:
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [117]:
df1['test_score(out of 10)'].fillna(0, inplace=True)

In [118]:
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    0.0                           7      72000
7          11                    7.0                           8      80000

In [119]:
x=df1.drop(columns=["salary($)"])

In [120]:
y=df['salary($)']

In [121]:
print(x)

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    0.0                           7
7          11                    7.0                           8

In [122]:
print(y)

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [123]:
from sklearn.linear_model import LinearRegression

In [124]:
model=LinearRegression()

In [125]:
model.fit(x,y)

LinearRegression()

In [126]:
ans=model.predict([[0,8,6]])

In [127]:
print(ans)

[45532.73818638]

In [129]:
n=int(input("experience:")) 
a=int(input("test_score(out of 10:"))
b=int(input("interview_score(out of 10):"))
ans=model.predict([[n,a,b]])
print(ans)

experience:7
test_score(out of 10:8
interview_score(out of 10):8
[71314.76434018]